tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "ktr0731/evans"
tap "kyleconroy/sqlc"
brew "asdf"
brew "bat"
brew "gcc"
brew "golang-migrate"
brew "grep"
brew "jq"
brew "lsd"
brew "neovim"
brew "openjdk@11"
brew "postgresql@14"
brew "procs"
brew "protobuf"
brew "r"
brew "sql-migrate"
brew "sqlc"
brew "tree"
brew "ktr0731/evans/evans"
cask "deepl"
cask "font-hack-nerd-font"
cask "notion"
cask "rstudio"
cask "tableplus"
cask "xquartz"
vscode "42crunch.vscode-openapi"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "adpyke.vscode-sql-formatter"
vscode "alefragnani.project-manager"
vscode "analytic-signal.preview-tiff"
vscode "apollographql.vscode-apollo"
vscode "arjun.swagger-viewer"
vscode "asvetliakov.vscode-neovim"
vscode "batisteo.vscode-django"
vscode "bierner.markdown-mermaid"
vscode "bradgashler.htmltagwrap"
vscode "bysabi.prettier-vscode-standard"
vscode "codezombiech.gitignore"
vscode "devil-cyber.keras-snippet"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "eighthundreds.vscode-drawio"
vscode "esafirm.kotlin-formatter"
vscode "esbenp.prettier-vscode"
vscode "fwcd.kotlin"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "hiro.go-err-highlighting"
vscode "hridoy.rails-snippets"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "ionutvmi.path-autocomplete"
vscode "james-yu.latex-workshop"
vscode "kaiwood.endwise"
vscode "kevinrose.vsc-python-indent"
vscode "keyhr.42-c-format"
vscode "kube.42header"
vscode "kumar-harsh.graphql-for-vscode"
vscode "mariusvanwijk-joppekoers.codam-norminette-3"
vscode "marp-team.marp-vscode"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "meezilla.json"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "nickfode.latex-formatter"
vscode "njpwerner.autodocstring"
vscode "pkief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "rebornix.ruby"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "rvest.vs-code-prettier-eslint"
vscode "sianglim.slim"
vscode "streetsidesoftware.code-spell-checker"
vscode "techtrain.railway-vscode"
vscode "tht13.html-preview-vscode"
vscode "timonwong.shellcheck"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "wholroyd.jinja"
vscode "wingrunr21.vscode-ruby"
vscode "withfig.fig"
vscode "ziyasal.vscode-open-in-github"
vscode "zoellner.openapi-preview"
vscode "zxh404.vscode-proto3"
